# Import pandas and Read the CSV file

In [2]:
import pandas as pd 
dff = pd.read_csv("fifa_ranking.csv")

# Csv File Opening With Link

In [ ]:
import requests
import io
import pandas as pd

# URL of the CSV file from the API
url = ""

# Fetch the CSV file
response = requests.get(url)

# Read CSV into a pandas DataFrame
csv_data = io.StringIO(response.text)
df = pd.read_csv(csv_data)

# Display the first few rows
print(df.head())

# Tsv file Open

In [23]:
# Read a TSV (tab-separated) file. 
# sep="\t" tells pandas to split columns at each tab character.
# names=[...] provides custom column names for the DataFrame.
data = pd.read_csv("demo.tsv", sep="\t", names=['sno','Movie Name','release_year','rating','votes','genres'])
print(data.head(5))

  sno                  Movie Name release_year  rating     votes  \
0  m0  10 things i hate about you         1999     6.9   62847.0
1  m1  1492: conquest of paradise         1992     6.2   10421.0
2  m2                  15 minutes         2001     6.1   25854.0
3  m3       2001: a space odyssey         1968     8.4  163227.0
4  m4                     48 hrs.         1982     6.9   22289.0

                                           genres
0                            ['comedy' 'romance']
1     ['adventure' 'biography' 'drama' 'history']
2           ['action' 'crime' 'drama' 'thriller']
3                ['adventure' 'mystery' 'sci-fi']
4  ['action' 'comedy' 'crime' 'drama' 'thriller']

In [26]:
train_data = pd.read_csv("train.csv", index_col="enrollee_id") # making the Index Column
print(train_data)

                 city  city_development_index gender      relevent_experience  \
enrollee_id
8949         city_103                   0.920   Male  Has relevent experience
29725         city_40                   0.776   Male   No relevent experience
11561         city_21                   0.624    NaN   No relevent experience
33241        city_115                   0.789    NaN   No relevent experience
666          city_162                   0.767   Male  Has relevent experience
...               ...                     ...    ...                      ...
7386         city_173                   0.878   Male   No relevent experience
31398        city_103                   0.920   Male  Has relevent experience
24576        city_103                   0.920   Male  Has relevent experience
5756          city_65                   0.802   Male  Has relevent experience
23834         city_67                   0.855    NaN   No relevent experience

            enrolled_university education_level major_discipline experience  \
enrollee_id
8949              no_enrollment        Graduate             STEM        >20
29725             no_enrollment        Graduate             STEM         15
11561          Full time course        Graduate             STEM          5
33241                       NaN        Graduate  Business Degree         <1
666               no_enrollment         Masters             STEM        >20
...                         ...             ...              ...        ...
7386              no_enrollment        Graduate       Humanities         14
31398             no_enrollment        Graduate             STEM         14
24576             no_enrollment        Graduate             STEM        >20
5756              no_enrollment     High School              NaN         <1
23834             no_enrollment  Primary School              NaN          2

            company_size    company_type last_new_job  training_hours  target
enrollee_id
8949                 NaN             NaN            1              36     1.0
29725              50-99         Pvt Ltd           >4              47     0.0
11561                NaN             NaN        never              83     0.0
33241                NaN         Pvt Ltd        never              52     1.0
666                50-99  Funded Startup            4               8     0.0
...                  ...             ...          ...             ...     ...
7386                 NaN             NaN            1              42     1.0
31398                NaN             NaN            4              52     1.0
24576              50-99         Pvt Ltd            4              44     0.0
5756             500-999         Pvt Ltd            2              97     0.0
23834                NaN             NaN            1             127     0.0

[19158 rows x 13 columns]

# Header parameter

In [4]:
test = pd.read_csv("demo_test.csv", header=1)
print(test)

   0  enrollee_id      city  city_development_index gender  \
0  1        29725   city_40                   0.776   Male
1  2        11561   city_21                   0.624    NaN
2  3        33241  city_115                   0.789    NaN
3  4          666  city_162                   0.767   Male

       relevent_experience enrolled_university education_level  \
0   No relevent experience       no_enrollment        Graduate
1   No relevent experience    Full time course        Graduate
2   No relevent experience                 NaN        Graduate
3  Has relevent experience       no_enrollment         Masters

  major_discipline experience company_size    company_type last_new_job  \
0             STEM         15        50-99         Pvt Ltd           >4
1             STEM          5          NaN             NaN        never
2  Business Degree         <1          NaN         Pvt Ltd        never
3             STEM        >20        50-99  Funded Startup            4

   training_hours  target
0              47       0
1              83       0
2              52       1
3               8       0

# use_cols parameter

In [8]:
value = pd.read_csv("train.csv", index_col="enrollee_id", usecols=['enrollee_id','gender','education_level'])
print(value)

            gender education_level
enrollee_id
8949          Male        Graduate
29725         Male        Graduate
11561          NaN        Graduate
33241          NaN        Graduate
666           Male         Masters
...            ...             ...
7386          Male        Graduate
31398         Male        Graduate
24576         Male        Graduate
5756          Male     High School
23834          NaN  Primary School

[19158 rows x 2 columns]

# Skiprows/nrows Parameter

In [25]:
sque = pd.read_csv('train.csv',skiprows=1, nrows=100) # skip the 1st row and read until 100
print(sque)

     8949  city_103   0.92  Male  Has relevent experience     no_enrollment  \
0   29725   city_40  0.776  Male   No relevent experience     no_enrollment
1   11561   city_21  0.624   NaN   No relevent experience  Full time course
2   33241  city_115  0.789   NaN   No relevent experience               NaN
3     666  city_162  0.767  Male  Has relevent experience     no_enrollment
4   21651  city_176  0.764   NaN  Has relevent experience  Part time course
..    ...       ...    ...   ...                      ...               ...
95   7364  city_160  0.920   NaN   No relevent experience  Full time course
96  11184   city_74  0.579   NaN   No relevent experience  Full time course
97   7016   city_65  0.802  Male  Has relevent experience     no_enrollment
98   8695   city_11  0.550  Male  Has relevent experience     no_enrollment
99   6172   city_11  0.550  Male  Has relevent experience     no_enrollment

       Graduate             STEM  >20 Unnamed: 9     Unnamed: 10      1   36  \
0      Graduate             STEM   15      50-99         Pvt Ltd     >4   47
1      Graduate             STEM    5        NaN             NaN  never   83
2      Graduate  Business Degree   <1        NaN         Pvt Ltd  never   52
3       Masters             STEM  >20      50-99  Funded Startup      4    8
4      Graduate             STEM   11        NaN             NaN      1   24
..          ...              ...  ...        ...             ...    ...  ...
95  High School              NaN    2    100-500         Pvt Ltd      1  142
96     Graduate             STEM    2    100-500         Pvt Ltd      1   34
97     Graduate             STEM    6      50-99         Pvt Ltd      2   14
98     Graduate             STEM    6      10/49         Pvt Ltd      2   27
99     Graduate             STEM    8    100-500         Pvt Ltd      1   24

    1.0
0   0.0
1   0.0
2   1.0
3   0.0
4   1.0
..  ...
95  0.0
96  0.0
97  1.0
98  1.0
99  1.0

[100 rows x 14 columns]

# Encoding 
### Computers store text as bytes (0s and 1s). 
### Encoding is the mapping between characters and bytes.
### Genarally Programe/file Encoded in UTF-8 but if it's not UTF-8 we need to Specify the Encoding

In [28]:
enco = pd.read_csv('zomato.csv',encoding='latin-1')
print(enco.head())

   Restaurant ID         Restaurant Name  Country Code              City  \
0        6317637        Le Petit Souffle           162       Makati City
1        6304287        Izakaya Kikufuji           162       Makati City
2        6300002  Heat - Edsa Shangri-La           162  Mandaluyong City
3        6318506                    Ooma           162  Mandaluyong City
4        6314302             Sambo Kojin           162  Mandaluyong City

                                             Address  \
0  Third Floor, Century City Mall, Kalayaan Avenu...
1  Little Tokyo, 2277 Chino Roces Avenue, Legaspi...
2  Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...
3  Third Floor, Mega Fashion Hall, SM Megamall, O...
4  Third Floor, Mega Atrium, SM Megamall, Ortigas...

                                     Locality  \
0   Century City Mall, Poblacion, Makati City
1  Little Tokyo, Legaspi Village, Makati City
2  Edsa Shangri-La, Ortigas, Mandaluyong City
3      SM Megamall, Ortigas, Mandaluyong City
4      SM Megamall, Ortigas, Mandaluyong City

                                    Locality Verbose   Longitude   Latitude  \
0  Century City Mall, Poblacion, Makati City, Mak...  121.027535  14.565443
1  Little Tokyo, Legaspi Village, Makati City, Ma...  121.014101  14.553708
2  Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...  121.056831  14.581404
3  SM Megamall, Ortigas, Mandaluyong City, Mandal...  121.056475  14.585318
4  SM Megamall, Ortigas, Mandaluyong City, Mandal...  121.057508  14.584450

                           Cuisines  ...          Currency Has Table booking  \
0        French, Japanese, Desserts  ...  Botswana Pula(P)               Yes
1                          Japanese  ...  Botswana Pula(P)               Yes
2  Seafood, Asian, Filipino, Indian  ...  Botswana Pula(P)               Yes
3                   Japanese, Sushi  ...  Botswana Pula(P)                No
4                  Japanese, Korean  ...  Botswana Pula(P)               Yes

  Has Online delivery Is delivering now Switch to order menu Price range  \
0                  No                No                   No           3
1                  No                No                   No           3
2                  No                No                   No           4
3                  No                No                   No           4
4                  No                No                   No           4

   Aggregate rating  Rating color Rating text Votes
0               4.8    Dark Green   Excellent   314
1               4.5    Dark Green   Excellent   591
2               4.4         Green   Very Good   270
3               4.9    Dark Green   Excellent   365
4               4.8    Dark Green   Excellent   229

[5 rows x 21 columns]

# Loading a huge dataset in chunks

In [41]:
dfs = pd.read_csv("train.csv", chunksize=200)
print(dfs)

<pandas.io.parsers.readers.TextFileReader object at 0x000001CC697128F0>

In [40]:
for chunks in dfs:
    print(chunk.shape)